ashutoshnaveen/lovebox-server/firmware/lovebox_esp32/src/main.cpp
int activeColorIndex = 0;

// 1-bit overlay: 320 * 240 / 8 = 9600 bytes
uint8_t overlayBuffer[(SCREEN_WIDTH * SCREEN_HEIGHT) / 8];

bool captionVisible = true;
bool toolbarVisible = false;
bool drawModeActive = false;
bool overlayHasStrokes = false;   // True once at least one pixel is drawn
bool strokeButtonsShown = false;  // True after CLR/SEND have been rendered

bool touchReady = false;
bool wasTouched = false;
int touchStartX = 0;
int touchStartY = 0;
int touchLastX = 0;
int touchLastY = 0;
bool touchMoved = false;
int touchDownSamples = 0;          // Samples seen since contact began
unsigned long touchUpAt = 0;       // Time of last release (debounce)
const int TOUCH_SETTLE_SAMPLES = 3;          // Discard noisy first samples
const unsigned long TOUCH_DEBOUNCE_MS = 60;  // Ignore taps right after release
unsigned long lastPollAt = 0;

String toastText;
unsigned long toastUntil = 0;

// Forward declarations
void displayCaption();
LatestMessage fetchLatestMessage();
bool downloadAndDisplayImage(const String& imageId);
void sendAck();
void animateHeart();
void moveServo(int fromAngle, int toAngle);
bool downloadAudioFile(const String& audioId);
bool playAudioFile();
bool playNotificationTone();
void renderScreen();
void handleTap(int x, int y);
bool sendLikeFeedback();
bool sendDrawingFeedback();
bool sendHealthReport();
bool checkForFirmwareUpdate();
bool initI2SAudio();

// ---------------------------------------------------------------------------
// Screen helpers
// ---------------------------------------------------------------------------
void showScreen(
  const String& heading,
  const String& line1 = "",
  const String& line2 = "",
  uint16_t headingColor = ILI9341_RED
) {
  tft.fillScreen(ILI9341_BLACK);

  tft.setTextWrap(true);

  tft.setTextColor(headingColor, ILI9341_BLACK);
  tft.setTextSize(3);
  tft.setCursor(20, 25);
  tft.println(heading);

  tft.setTextColor(ILI9341_WHITE, ILI9341_BLACK);
  tft.setTextSize(2);

  if (line1.length() > 0) {
    tft.setCursor(20, 95);
    tft.println(line1);
  }

  if (line2.length() > 0) {
    tft.setTextColor(ILI9341_GREEN, ILI9341_BLACK);
    tft.setCursor(20, 155);
    tft.println(line2);
  }
}

bool displayStoredImage() {
  if (!imageStorageReady || !FFat.exists(IMAGE_PATH)) return false;

  File imageFile = FFat.open(IMAGE_PATH, FILE_READ);
  if (!imageFile || imageFile.size() != IMAGE_SIZE) {
    Serial.printf("Cached image invalid: %d bytes\n", imageFile ? imageFile.size() : -1);
    if (imageFile) imageFile.close();
    return false;
  }

  Serial.printf("Rendering cached image: %d bytes\n", imageFile.size());
  tft.setAddrWindow(0, 0, SCREEN_WIDTH, SCREEN_HEIGHT);
  tft.startWrite();

  const int CHUNK_PIXELS = 512;
  uint16_t pixels[CHUNK_PIXELS];
  int remaining = IMAGE_SIZE;

  while (remaining > 0) {
    int bytesRead = imageFile.read(reinterpret_cast<uint8_t*>(pixels), min(remaining, CHUNK_PIXELS * 2));
    if (bytesRead <= 0 || bytesRead % 2 != 0) break;

    tft.writePixels(pixels, bytesRead / 2, true);
    remaining -= bytesRead;
  }

  tft.endWrite();
  imageFile.close();
  return remaining == 0;
}

void configModeCallback(WiFiManager* wifiManager) {
  Serial.println("Wi-Fi setup portal started");

  String apName = wifiManager->getConfigPortalSSID();

  showScreen(
    "WI-FI SETUP",
    "Connect phone to:",
    apName,
    ILI9341_YELLOW
  );

  Serial.print("Setup network: ");
  Serial.println(apName);
  Serial.println("Open http://192.168.4.1 if portal does not open");
}

void saveConfigCallback() {
  Serial.println("New Wi-Fi credentials saved");

  showScreen(
    "SAVED!",
    "Wi-Fi details stored",
    "Restarting..."
  );
}

// ---------------------------------------------------------------------------
// Touch overlay helpers
// ---------------------------------------------------------------------------
int mapTouchToScreenX(int rawX) {
  return constrain(map(rawX, RAW_X_MIN, RAW_X_MAX, 0, SCREEN_WIDTH - 1), 0, SCREEN_WIDTH - 1);
}

int mapTouchToScreenY(int rawY) {
  return constrain(map(rawY, RAW_Y_MIN, RAW_Y_MAX, 0, SCREEN_HEIGHT - 1), 0, SCREEN_HEIGHT - 1);
}

bool isInButton(int x, int y, const Button& btn) {
  return x >= btn.x && x < btn.x + btn.w && y >= btn.y && y < btn.y + btn.h;
}

bool isInAnyControl(int x, int y) {
  if (isInButton(x, y, heartBtn)) return true;
  if (currentCaption.length() > 0 && isInButton(x, y, capBtn)) return true;
  if (!toolbarVisible) {
    if (isInButton(x, y, penBtn)) return true;
    if (isInButton(x, y, replayBtn)) return true;
  } else {
    for (int i = 0; i < SWATCH_COUNT; i++) {
      const ColorSwatch& s = swatches[i];
      if (x >= s.x && x < s.x + s.w && y >= s.y && y < s.y + s.h) return true;
    }
    // CLR/SEND only active once something has been drawn
    if (overlayHasStrokes) {
      if (isInButton(x, y, clearBtn)) return true;
      if (isInButton(x, y, sendBtn)) return true;
    }
    if (isInButton(x, y, closeBtn)) return true;
  }
  return false;
}

bool getOverlayPixel(int x, int y) {
  if (x < 0 || x >= SCREEN_WIDTH || y < 0 || y >= SCREEN_HEIGHT) return false;
  int idx = y * SCREEN_WIDTH + x;
  return overlayBuffer[idx >> 3] & (1 << (idx & 7));
}

void setOverlayPixel(int x, int y) {
  if (x < 0 || x >= SCREEN_WIDTH || y < 0 || y >= SCREEN_HEIGHT) return;
  int idx = y * SCREEN_WIDTH + x;
  int byteIdx = idx >> 3;
  uint8_t bit = 1 << (idx & 7);
  if (overlayBuffer[byteIdx] & bit) return;
  overlayBuffer[byteIdx] |= bit;
  overlayHasStrokes = true;
  tft.drawPixel(x, y, swatches[activeColorIndex].color);
}

void clearOverlay() {
  memset(overlayBuffer, 0, sizeof(overlayBuffer));
  overlayHasStrokes = false;
  strokeButtonsShown = false;
}

void drawLine(int x0, int y0, int x1, int y1) {
  int dx = abs(x1 - x0), sx = x0 < x1 ? 1 : -1;
  int dy = -abs(y1 - y0), sy = y0 < y1 ? 1 : -1;
  int err = dx + dy;

  tft.startWrite();
  while (true) {
    setOverlayPixel(x0, y0);
    if (x0 == x1 && y0 == y1) break;
    int e2 = 2 * err;
    if (e2 >= dy) { err += dy; x0 += sx; }
    if (e2 <= dx) { err += dx; y0 += sy; }
  }
  tft.endWrite();
}

