ashutoshnaveen/lovebox-server/firmware/lovebox_esp32/src/main.cpp
void resetFeedbackState() {
  clearOverlay();
  toolbarVisible = false;
  drawModeActive = false;
  strokeButtonsShown = false;
}// ---------------------------------------------------------------------------
// UI rendering
// ---------------------------------------------------------------------------
void drawButton(const Button& btn, uint16_t bg, uint16_t fg, const char* label) {
  tft.fillRoundRect(btn.x, btn.y, btn.w, btn.h, 4, bg);
  tft.setTextColor(fg, bg);
  tft.setTextSize(2);  // Bold, clearly readable at 320x240
  int16_t w = strlen(label) * 12;  // 6px per char * scale 2
  tft.setCursor(btn.x + (btn.w - w) / 2, btn.y + (btn.h - 14) / 2);
  tft.print(label);
}

void drawHeartButton(const Button& btn) {
  tft.fillRoundRect(btn.x, btn.y, btn.w, btn.h, 4, ILI9341_RED);
  int cx = btn.x + btn.w / 2;
  int cy = btn.y + btn.h / 2 - 1;
  tft.fillCircle(cx - 8, cy - 4, 7, ILI9341_WHITE);
  tft.fillCircle(cx + 8, cy - 4, 7, ILI9341_WHITE);
  tft.fillTriangle(cx - 15, cy - 2, cx + 15, cy - 2, cx, cy + 14, ILI9341_WHITE);
}

void renderUI() {
  drawHeartButton(heartBtn);

  if (currentCaption.length() > 0) {
    drawButton(capBtn, captionVisible ? 0x780F : 0x5A69, ILI9341_WHITE, "CAPTION");
  }

  if (!toolbarVisible) {
    // Blue background -> white text
    drawButton(penBtn, ILI9341_BLUE, ILI9341_WHITE, "PEN");
    // Purple/Magenta background -> white text
    drawButton(replayBtn, 0x780F, ILI9341_WHITE, "PLAY");
  } else {
    // Color swatches (active one gets a white outline)
    for (int i = 0; i < SWATCH_COUNT; i++) {
      const ColorSwatch& s = swatches[i];
      tft.fillRect(s.x, s.y, s.w, s.h, s.color);
      if (i == activeColorIndex) {
        tft.drawRect(s.x - 1, s.y - 1, s.w + 2, s.h + 2, ILI9341_WHITE);
      } else {
        tft.drawRect(s.x - 1, s.y - 1, s.w + 2, s.h + 2, ILI9341_BLACK);
      }
    }
    tft.fillRect(0, TOOLBAR_Y, SCREEN_WIDTH, TOOLBAR_H, ILI9341_BLACK);
    if (overlayHasStrokes) {
      // Dark grey background -> white text
      drawButton(clearBtn, 0x5A69, ILI9341_WHITE, "CLR");
      // Green background -> white text
      drawButton(sendBtn, ILI9341_GREEN, ILI9341_WHITE, "SEND");
    }
    // Red background -> white text
    drawButton(closeBtn, ILI9341_RED, ILI9341_WHITE, "CLOSE");
  }
}

void renderScreen() {
  if (!displayStoredImage()) {
    tft.fillScreen(ILI9341_BLACK);
  }
  displayCaption();
  renderUI();
}

void flashRect(const Button& btn) {
  tft.drawRect(btn.x - 2, btn.y - 2, btn.w + 4, btn.h + 4, ILI9341_WHITE);
  delay(120);
  renderUI();
}

void displayCaption() {
  if (!captionVisible || currentCaption.length() == 0) return;
  const int capY = 42;
  const int capH = 22;
  tft.fillRect(0, capY, SCREEN_WIDTH, capH, ILI9341_BLACK);
  tft.setTextColor(ILI9341_WHITE, ILI9341_BLACK);
  tft.setTextSize(1);
  tft.setTextWrap(true);
  tft.setCursor(5, capY + 4);
  tft.print(currentCaption);
}

void showToast(const String& text) {
  toastText = text;
  toastUntil = millis() + 1500;
  tft.fillRect(60, 100, 200, 40, ILI9341_BLACK);
  tft.drawRect(60, 100, 200, 40, ILI9341_WHITE);
  tft.setTextColor(ILI9341_WHITE, ILI9341_BLACK);
  tft.setTextSize(2);
  tft.setCursor(80, 113);
  tft.print(text);
}

void clearToast() {
  if (toastUntil > 0 && millis() > toastUntil) {
    toastUntil = 0;
    renderScreen();
  }
}

// ---------------------------------------------------------------------------
// Touch handling
// ---------------------------------------------------------------------------
void handleTouch() {
  if (!touchReady) return;

  // Poll touched() FIRST: it triggers a fresh XPT2046 read.
  // Calling getPoint() first returns stale coordinates from the previous touch.
  bool isTouched = touch.touched();
  TS_Point p = touch.getPoint();

  if (!wasTouched && isTouched) {
    if (touchUpAt != 0 && millis() - touchUpAt < TOUCH_DEBOUNCE_MS) {
      return;  // Bounce right after release: ignore
    }
    // Contact just began: record sample count, don't trust coordinates yet.
    touchDownSamples = 0;
    touchMoved = false;
    wasTouched = true;
    return;
  }

  if (wasTouched && isTouched) {
    touchDownSamples++;
    if (touchDownSamples < TOUCH_SETTLE_SAMPLES) {
      return;  // Discard noisy early samples while pressure stabilizes
    }
    int x = mapTouchToScreenX(p.x);
    int y = mapTouchToScreenY(p.y);
    if (touchDownSamples == TOUCH_SETTLE_SAMPLES) {
      // First stable sample: anchor the gesture here
      touchStartX = x;
      touchStartY = y;
      touchLastX = x;
      touchLastY = y;
      Serial.printf("touch down: raw=%d,%d screen=%d,%d z=%d\n", p.x, p.y, x, y, p.z);
      return;
    }
    if (abs(x - touchStartX) > 5 || abs(y - touchStartY) > 5) touchMoved = true;

    // Spike rejection: a single wild sample (shared-SPI glitch or pressure
    // flicker) would draw a long stray line. Skip jumps that are physically
    // impossible between two consecutive ~3ms samples.
    if (abs(x - touchLastX) > 60 || abs(y - touchLastY) > 60) {
      Serial.printf("touch spike rejected: %d,%d -> %d,%d\n", touchLastX, touchLastY, x, y);
      return;
    }

    // Light smoothing: average with previous point to reduce jitter
    int sx = (x + touchLastX) / 2;
    int sy = (y + touchLastY) / 2;

    if (drawModeActive && !isInAnyControl(sx, sy)) {
      drawLine(touchLastX, touchLastY, sx, sy);
      // First stroke of the session: reveal CLR/SEND buttons now
      if (overlayHasStrokes && !strokeButtonsShown) {
        strokeButtonsShown = true;
        renderUI();
      }
    }
    touchLastX = sx;
    touchLastY = sy;
    return;
  }

  if (wasTouched && !isTouched) {
    wasTouched = false;
    touchUpAt = millis();
    Serial.printf("touch up: screen=%d,%d moved=%s\n", touchStartX, touchStartY, touchMoved ? "yes" : "no");
    if (!touchMoved && touchDownSamples >= TOUCH_SETTLE_SAMPLES) {
      handleTap(touchStartX, touchStartY);
    }
  }
}

void handleTap(int x, int y) {
  if (isInButton(x, y, heartBtn)) {
    Serial.println("tap: heart");
    flashRect(heartBtn);
    if (sendLikeFeedback()) {
      showToast("Liked!");
    } else {
      showToast("Like failed");
    }
    return;
  }

